import { TermsOfServiceIcon } from "@/components/icons/TersmOfservise";

export default function TermsOfService() {
  return (
    <div className="container mx-auto  p-5 w-[1200px] flex flex-col gap-2  max-sm:w-[375px]">
      <div className="flex gap-3 py-5">
        <TermsOfServiceIcon />
        <h1 className="font-bold text-2xl ">Нууцлалын бодлого</h1>
      </div>
      <div className="text-lg font-normal gap-24 left-[120px] top-[89px] ">
        <p className="indent-11">
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        </p>
        <p className="indent-7">
          {" "}
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </p>
        <p>
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </p>
        <p>
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        </p>
        <p className="indent-7">
          {" "}
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </p>
        <p className="indent-12 mb-10">
          {" "}
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </p>
        <p className="indent-2">
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </p>
        <p className="indent-12 mb-10">
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </p>
        <p className="indent-11">
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        </p>
        <p className="indent-7">
          {" "}
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </p>
        <p>
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </p>
        <p>
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
        </p>
        <p className="indent-7">
          {" "}
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </p>
        <p className="indent-12 mb-10">
          {" "}
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </p>
        <p className="indent-2">
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ.
        </p>
        <p className="indent-12 h-[100px]">
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </p>
      </div>
    </div>
  );
}
